# Taps
# tap 'caskroom/cask'
# tap 'caskroom/fonts'
# tap 'homebrew/bundle'

# Install ZSH
#brew 'bash' # Latest Bash version
#brew 'bat' # "cat" on steroids
#brew 'coreutils' # Those that come with macOS are outdated
#brew 'git'
#brew 'gnupg2'
#brew 'grep'
#brew 'mackup'
#brew 'mas' # Mac App Store manager
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'trash' # Manage the Trash bin
#brew 'tree' # List directories in a tree structure
#brew 'zlib' # Needed for Memcached
#brew 'zplug' # ZSH Plugin Manager
#brew 'zsh'
#brew 'zsh-completions'

# Development
brew 'php@7.4'
brew 'php'

# Apps
# cask 'caffeine'
cask 'dbngin'
cask 'dropbox'
cask 'firefox'
#cask 'fluid'
cask 'google-drive-file-stream'
#cask 'gpg-suite'
# cask 'iterm2'
cask 'microsoft-office'
cask 'paw'
#cask 'phpstorm'
cask 'polymail'
cask 'private-internet-access'
#cask 'sequel-pro'
#cask 'shuttle'
cask 'sizeup'
#cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'teamviewer'
cask 'tower'
cask 'transmit'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Install Mac App Store apps
#mas '1Password', id: 1333542190
#mas 'Color Picker', id: 641027709
#mas 'Uberlayer', id: 510139938
#mas 'WhatsApp', id: 1147396723 
#mas 'The Unarchiver', id: 425424353