# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'nvm'
brew 'trash'
brew 'wget'

# Development
brew 'php@7.0'
brew 'php@7.1'
brew 'php@7.2'
brew 'php@7.3'
brew 'mysql@5.7'

# Apps
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'google-drive-file-stream'
cask 'gpg-suite'
cask 'iterm2'
cask 'microsoft-office'
cask 'paw'
cask 'phpstorm'
cask 'polymail'
cask 'private-internet-access'
cask 'sequel-pro'
cask 'shuttle'
cask 'sizeup'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'teamviewer'
cask 'tower'
cask 'transmit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Color Picker', id: 641027709
mas 'Uberlayer', id: 510139938